Repository: HuynhMinh2003/app_maytinh_gia
Catalog: lib/l10n/intl_*.arb
Languages: vi

# content_welcome_1
source: The app supports quick, accurate, and easy calculations.
vi: Ứng dụng hỗ trợ tính toán nhanh chóng, chính xác và dễ sử dụng.

# content_welcome_2
source: Always ready to help you handle calculations from simple to complex anytime, anywhere.
vi: Luôn sẵn sàng giúp bạn xử lý các phép toán từ đơn giản đến phức tạp mọi lúc, mọi nơi.

# content_welcome_3
source: An intuitive interface helps you operate quickly without complicated instructions.
vi: Giao diện trực quan giúp bạn thao tác nhanh chóng mà không cần hướng dẫn phức tạp.

# content_welcome_4
source: Designed to deliver the smoothest and most efficient experience for all users.
vi: Được thiết kế để mang lại trải nghiệm mượt mà và hiệu quả nhất cho mọi người dùng.

# content_welcome_5
source: Easily customizable to fit your needs and optimize your daily work.
vi: Dễ dàng tùy chỉnh theo nhu cầu của bạn để tối ưu công việc hằng ngày.

# content_welcome_6
source: Absolute information security to give you peace of mind anytime, anywhere.
vi: Bảo mật thông tin tuyệt đối, giúp bạn yên tâm sử dụng mọi lúc, mọi nơi.

source: Continue
vi: Tiếp tục

# con_tinue1
source: Next
vi: Tiếp

# welcome_1
source: Welcome to the handheld calculator app
vi: Chào mừng đến ứng dụng máy tính cầm tay

# welcome_2
source: Discover amazing features
vi: Khám phá tính năng tuyệt vời

# welcome_3
source: Start your journey with us
vi: Bắt đầu hành trình cùng chúng tôi

# app_title
source: Calculator
vi: Máy tính

source: Enter PIN
vi: Nhập mã pin

source: Re-enter PIN
vi: Nhập lại mã pin

source: Confirm
vi: Xác nhận

# msg_pin_empty
source: Please enter the PIN!!!
vi: Vui lòng nhập mã pin !!!

# msg_pin_not_match
source: PINs do not match!!!
vi: Mã pin không khớp !!!

# msg_pin_success
source: PIN setup successfully!!!
vi: Thiết lập mã pin thành công !!!

# msg_pin_error
source: Error saving PIN.
vi: Lỗi khi lưu mã pin.

# msg_error
source: Error: {error}
vi: Lỗi: {error}

source: Calculation error
vi: Lỗi tính toán

# input_checkpin
source: Enter PIN
vi: Nhập mã pin

# checkpin
source: Check
vi: Kiểm tra

# checkpin_false
source: Valid PIN
vi: Mã pin hợp lệ

# checkpin_okay
source: Incorrect PIN
vi: Mã pin không đúng

# setting1
source: Set PIN code
vi: Cài đặt mã pin

# setting2
source: Language Settings
vi: Cài đặt ngôn ngữ

# setting3
source: Information
vi: Thông tin

# setting4
source: Rate app
vi: Đánh giá

# setting5
source: Share
vi: Chia sẻ

# type
source: Select media type
vi: Chọn loại phương tiện

# type_1
source: Image
vi: Ảnh

# type_3
source: Favorite file
vi: File yêu thích

# type_4
source: Folder
vi: Thư mục

# error_1
source: Failed to delete image
vi: Xóa ảnh thất bại

# delete_1
source: Delete image
vi: Xóa ảnh

# delete_12
source: Are you sure you want to delete this image?
vi: Bạn có chắc chắn muốn xóa ảnh này không?

# delete_13
source: Cancel
vi: Hủy

# delete_14
source: Image deleted successfully!
vi: Đã xóa ảnh thành công!

# delete_15
source: Delete
vi: Xóa

# title_1
source: Images
vi: Ảnh

# title_2
source: Add image
vi: Thêm ảnh

# no_images
source: No images available
vi: Chưa có ảnh nào

# no_videos
source: No videos available
vi: Chưa có video nào

# error_2
source: Failed to hide video
vi: Xóa video thất bại

# delete_2
source: Delete video
vi: Xóa video

# delete_22
source: Are you sure you want to delete this video?
vi: Bạn có chắc chắn muốn xóa video này không?

# delete_23
source: Cancel
vi: Hủy

# delete_24
source: Video deleted successfully!
vi: Đã xóa video thành công!

# delete_25
source: Delete
vi: Xóa

# title_12
source: Videos
vi: Video

# title_22
source: Add video
vi: Thêm video

source: Move to folder
vi: Di chuyển vào thư mục

# chooseFolderToMove
source: Choose folder
vi: Chọn thư mục

source: No folders available.
vi: Chưa có thư mục nào.

# cancel1
source: Cancel
vi: Hủy

source: Move
vi: Di chuyển

source: Move successful
vi: Di chuyển thành công

source: Move failed
vi: Di chuyển thất bại

# changePinTitle
source: Change PIN
vi: Đổi mã PIN

# oldPinLabel
source: Enter old PIN
vi: Nhập mã PIN cũ

# newPinLabel
source: Enter new PIN
vi: Nhập mã PIN mới

# confirmPinLabel
source: Confirm new PIN
vi: Xác nhận mã PIN mới

# fillAllFieldsError
source: All fields must be filled!
vi: Phải điền đủ thông tin mã !!!

# pinMismatchError
source: New PIN and confirmation must match.
vi: Mã PIN mới và xác nhận phải giống nhau.

# oldPinValidationError
source: Old PIN validation failed.
vi: Lỗi xác thực mã PIN cũ.

# oldPinIncorrectError
source: Old PIN is incorrect.
vi: Mã PIN cũ không đúng.

# changePinSuccess
source: PIN updated successfully!
vi: Đã cập nhật mã PIN thành công!

# changePinFailed
source: Failed to change PIN.
vi: Đổi mã PIN thất bại.

# changePinButton
source: Change PIN
vi: Đổi mã PIN

# favoriteTitle
source: Favorites
vi: Yêu thích

# noFavoritesMessage
source: No favorite images or videos yet.
vi: Chưa có ảnh hoặc video yêu thích nào.

# title_app
source: Information
vi: Thông tin

# title_app1
source: Application Information
vi: Thông tin ứng dụng

# info_app
source: This app was developed by student Huỳnh Nhật Minh
vi: App được xây dựng bởi sinh viên Huỳnh Nhật Minh

source: App Version
vi: Phiên bản ứng dụng

source: Version:
vi: Phiên bản:

# build_version
source: Build Code:
vi: Mã build:

# okay
source: OK
vi: Đồng ý

# title_rate
source: Rate App
vi: Đánh giá ứng dụng

# content_rate
source: Tap a star to give your rating.
vi: Chạm vào một ngôi sao để đánh giá.

# rated
source: Submit
vi: Gửi

source: Cancel
vi: Hủy

# rate_info
source: Rating successful
vi: Đánh giá thành công

# title_policy
source: Policy
vi: Chính sách

# content_policy
source: The Fake Calculator app is intended for entertainment purposes only. We do not collect, store, or share any personal user data. All calculations and input data are processed solely on your device and are never transmitted externally. By using the app, you agree that it is not an accurate calculation tool for educational or work purposes.
vi: Ứng dụng Máy Tính Giả chỉ nhằm mục đích giải trí. Chúng tôi không thu thập, lưu trữ hay chia sẻ bất kỳ dữ liệu cá nhân nào của người dùng. Mọi phép tính và dữ liệu nhập vào chỉ được xử lý trên thiết bị của bạn và sẽ không được gửi ra ngoài. Bằng cách sử dụng ứng dụng, bạn đồng ý rằng đây không phải là công cụ tính toán chính xác cho mục đích học tập hay công việc.

source: Language
vi: Ngôn ngữ

# content_language
source: Language changed successfully
vi: Đổi ngôn ngữ thành công

# title_folder
source: Folder
vi: Thư mục

# add_folder
source: Create new folder
vi: Tạo thư mục mới

# dien_folder
source: Enter folder name
vi: Nhập tên thư mục

# no_folder
source: No folders available
vi: Chưa có thư mục nào

# cancel_folder
source: Cancel
vi: Hủy

# folder_name_required
source: Please enter a folder name
vi: Vui lòng nhập tên thư mục

# okay_folder
source: Create
vi: Tạo

# d
source: Folder created successfully
vi: Tạo thư mục thành công

# s
source: Folder creation failed
vi: Tạo thư mục thất bại

# restore_file_failed
source: Failed to delete file
vi: Xóa file thất bại

# restore_file_success
source: File deleted successfully
vi: Xóa file thành công

# delete_file_failed
source: Failed to delete file
vi: Xóa file thất bại

# error_occurred
source: An error occurred:
vi: Lỗi xảy ra:

# folder_empty
source: Folder is empty
vi: Folder trống

source: Cannot display image
vi: Không thể hiển thị ảnh

source: Not supported
vi: Không hỗ trợ

# file_empty
source: File is empty
vi: File rỗng

# restore_file
source: Delete file
vi: Xóa file

# confirm_restore_file_message
source: Do you want to delete this file?
vi: Bạn có muốn xóa file này không?

source: No
vi: Không

source: Yes
vi: Có

source: Rename Folder
vi: Đổi tên thư mục

# delete_folder_title
source: Delete Folder
vi: Xóa thư mục

# delete_folder_confirm
source: Are you sure you want to delete this folder?
vi: Bạn có chắc chắn muốn xóa thư mục này không?

# delete_success
source: Folder deleted successfully.
vi: Xóa thư mục thành công.

# delete_failed
source: Failed to delete folder.
vi: Xóa thư mục thất bại.

# rename_folder_title
source: Rename Folder
vi: Đổi tên thư mục

source: Enter new folder name
vi: Nhập tên thư mục mới

# rename_success
source: Folder renamed successfully.
vi: Đổi tên thư mục thành công.

# rename_failed
source: Failed to rename folder.
vi: Đổi tên thư mục thất bại.

# copy_to_gallery_title
source: Save Image to Gallery
vi: Tải ảnh về thư viện

# copy_to_gallery_content
source: Do you want to save this image to your device's gallery?
vi: Bạn có muốn tải ảnh này về thư viện ảnh trên thiết bị?

# copy_to_gallery_cancel
source: Cancel
vi: Hủy

# copy_to_gallery_confirm
source: Save
vi: Tải về

# copy_to_gallery_success
source: Image saved to gallery successfully
vi: Tải ảnh về thư viện thành công

# copy_to_gallery_fail
source: Failed to save image to gallery
vi: Tải ảnh về thư viện thất bại

# deleteVideoSuccess
source: Video deleted successfully
vi: Xóa video thành công

# deleteVideoFail
source: Failed to delete video
vi: Xóa video thất bại

# copyVideoToGallerySuccess
source: Video saved to gallery successfully
vi: Tải video về thư viện thành công

# copyVideoToGalleryFail
source: Failed to save video to gallery
vi: Tải video về thư viện thất bại

# copyVideoToGalleryTitle
source: Save video to gallery
vi: Tải video về thư viện

# copyVideoToGalleryConfirm
source: Do you want to save this video to your device's gallery?
vi: Bạn có muốn tải video này về thư viện trên thiết bị?

# video_cancel
source: Cancel
vi: Hủy

# copy
source: Save
vi: Tải về

# restore_folder_title
source: Download files to library
vi: Tải các file về thư viện

# restore_folder_confirm
source: Are you sure you want to download all files in this folder to the library?
vi: Bạn có chắc muốn tải toàn bộ tệp trong thư mục này ra thư viện?

# cancel2
source: Cancel
vi: Hủy

# restore_success
source: Files downloaded successfully
vi: Tải các file thành công

# restore_failed
source: File download failed
vi: Tải các file thất bại

# restore
source: Download
vi: Tải về

# delete_file_title
source: Delete File
vi: Xóa file

# delete_file_confirm
source: Are you sure you want to delete this file from the app?
vi: Bạn có chắc muốn xóa file này khỏi ứng dụng?

# delete_file_success
source: File deleted successfully
vi: Xóa file thành công

# delete_file_failed1
source: Failed to delete file
vi: Xóa file thất bại

# restore_file_title
source: Save File to Library
vi: Tải file về thư viện

# restore_file_confirm
source: Are you sure you want to save this file?
vi: Bạn có chắc muốn tải file này?

# restore_file_success1
source: File saved successfully
vi: Tải file thành công

# restore_file_failed1
source: Failed to save file
vi: Tải file thất bại

source: Delete
vi: Xóa

# restore3
source: Save
vi: Tải về

# cancel3
source: Cancel
vi: Hủy
